/* Date：2020/3/23 */ 
/* 1-3：修改温度转换程序，使之能在转换表的顶部打印一个标题 */ 

#include <stdio.h> 

int main(void)
{
	float fahr, celsius;
	int lower = 0, upper = 300, step = 20;
	
	fahr = lower;
	printf("摄氏与华氏温度转换表\n");
	printf("------------------------------\n");
	printf("华氏	摄氏\n"); 
	while (fahr <= upper)
	{
		celsius = 5.0 / 9.0 * (fahr - 32);
		printf("%3.0f	%6.1f\n", fahr, celsius);
		fahr += step;
	}
	return 0;
} 

/*
摄氏与华氏温度转换表
------------------------------
华氏    摄氏
  0      -17.8
 20       -6.7
 40        4.4
 60       15.6
 80       26.7
100       37.8
120       48.9
140       60.0
160       71.1
180       82.2
200       93.3
220      104.4
240      115.6
260      126.7
280      137.8
300      148.9

--------------------------------*/ 
