/* Date：2020/3/23 */ 
/* 1-4：编写一个程序打印摄氏温度转换为相应的华氏温度的转换表 */ 

#include <stdio.h> 

int main(void)
{
	float fahr, celsius;
	int lower = 0, upper = 300, step = 20;
	
	fahr = lower;
	printf("摄氏与华氏温度转换表\n");
	printf("------------------------------\n");
	printf("摄氏	华氏\n"); 
	while (fahr <= upper)
	{
		celsius = 5.0 / 9.0 * (fahr - 32);
		printf("%6.1f	%3.0f\n", celsius, fahr);
		fahr += step;
	}
	return 0;
} 

 
/* 结果：
摄氏与华氏温度转换表
------------------------------
摄氏    华氏
 -17.8    0
  -6.7   20
   4.4   40
  15.6   60
  26.7   80
  37.8  100
  48.9  120
  60.0  140
  71.1  160
  82.2  180
  93.3  200
 104.4  220
 115.6  240
 126.7  260
 137.8  280
 148.9  300

-------------------------------- */ 
