/* Date：2020/3/23 */ 
/* 1-5：修改温度转换程序，要求以逆序(即按照从300度到0度的顺序)打印温度转换表
 */ 

#include <stdio.h> 

int main(void)
{
	int fahr;
	
	printf("摄氏与华氏温度转换表\n");
	printf("------------------------------\n");
	printf("摄氏	华氏\n"); 
	for (fahr = 300; fahr >= 0; fahr -= 20)
		printf("%3d	%6.1f\n", fahr, 5.0 / 9.0 * (fahr - 32));
		
	return 0;
} 



/* 结果：
摄氏与华氏温度转换表
------------------------------
摄氏    华氏
300      148.9
280      137.8
260      126.7
240      115.6
220      104.4
200       93.3
180       82.2
160       71.1
140       60.0
120       48.9
100       37.8
 80       26.7
 60       15.6
 40        4.4
 20       -6.7
  0      -17.8

-------------------------------- */ 
